Repository: doc-autoit-fr/omegat
Catalog: tm/auto/AutoItFr_201503.tmx
Source language: en
Languages: fr

source: Sends data on an opened socket.
fr: Envoie des données sur un socket ouvert.

source: Returns the numeric representation of an expression.
fr: Retourne la représentation numérique d'une expression.

source: An expression to convert into a number.
fr: Une expression à convertir en nombre.

source: 3 = the result is double.
fr: 3 = le résultat est un 'double'.

source: Returns a number.
fr: Retourne un nombre.

source: If you pass number, function outputs the input.
fr: Si vous passez un nombre à la fonction, elle retourne ce nombre.

source: A string beginning with letters has a numeric value of zero.
fr: Une chaîne commençant par des lettres a une valeur numérique de zéro.

source: A string beginning with digits has non-numeric characters stripped.
fr: Une chaîne commençant par des chiffres, a ses caractères non-numériques ignorés à partir du premier.

source: Default behavior results in auto-sized integer.
fr: Le comportement par défaut donne un résultat convertit automatiquement dans le type 'integer'.

source: If input value after conversion is within the range of 32bit integer the result is 32bit integer.
fr: Si la valeur d'entrée après conversion est dans l'intervalle des entiers 32bit, le result est un 'integer' 32bit.

source: If not the result is 64bit integer.
fr: Sinon, le résultat est un integer 64bit.

source: Returns 13.
fr: Retourne 13.

source: Returns 3.14.
fr: Retourne 3.14.

source: Returns 24.
fr: Retourne 24.

source: Returns 0 as this is a string.
fr: Retourne 0 car c'est une chaîne.

source: Returns 1 as it strips everything after and including the first comma.
fr: Retourne 1 car il supprime tout ce qui suit après la première virgule (le séparateur décimal est le point!).

source: Obj/COM functions Reference
fr: Obj/COM - Référence Fonctions

source: Creates a reference to a COM object from the given classname.
fr: Crée une référence à un objet COM à partir d'un nom de classe donné.

source: Creates a reference to an object from the given classname/object pointer, interface identifier and description string.
fr: Crée une référence à un objet à partir du nom d'une classe ou d'un pointeur sur un objet, de l'identifiant d'une interface et d'une chaîne de description.

source: Handles incoming events from the given Object.
fr: Gère les événements entrants de l'objet donné.

source: Retrieves a reference to a COM object from an existing process or filename.
fr: Récupère une référence sur un objet COM à partir d'un processus ou d'un fichier existant.

source: Returns the name or interface description of an Object.
fr: Retourne le nom ou la description de l'interface d'un objet.

source: The class of the object in the following format:
fr: Le nom de la classe de l'objet dans le format suivant :

source: It can also be a string representation of the CLSID.
fr: Il peut également être une représentation de chaîne du CLSID.

source: name of a remote computer from which the object must be obtained.
fr: nom d'un ordinateur distant à partir duquel l'objet doit être obtenue.

source: name of a usercode on the remote computer.
fr: code utilisateur sur l'ordinateur distant.

source: You have to enter this in the format "computer\usercode" or "domain\usercode".
fr: Vous devez entrer ce code dans le format "ordinateur\usercode" ou "domaine\usercode".

source: password for the usercode on the remote computer.
fr: mot de passe pour le code utilisateur sur l'ordinateur distant.

source: an object.
fr: Retourne un objet.

source: Use ObjCreate() if you want to have a new instance of the referring application.
fr: Utilisez ObjCreate() si vous voulez avoir une nouvelle instance de l'application référencé.

source: If you want to connect to an existing process, use ObjGet() instead.
fr: Si vous souhaitez vous connecter à un processus existant, utilisez à la place ObjGet().

source: Keep in mind that not all computers have the same set of Objects.
fr: Gardez à l'esprit que tous les ordinateurs ont le même ensemble d'Objets.

source: So always check for errors after calling ObjCreate().
fr: Donc testez toujours les erreurs après un appel de ObjCreate().

source: To check errors use ObjEvent().
fr: Pour tester les erreurs utilisez ObjEvent() .

source: The following requirements apply if you want to access objects on remote computers:
fr: Les exigences suivantes s'appliquent si vous voulez accéder à des objets sur des ordinateurs distants :

source: The user running the script must have the appropriate permissions.
fr: L'utilisateur qui exécute le script doit avoir des droits appropriés.

source: The Object on the remote computer must support DCOM (Distributed COM)
fr: L'Objet sur l'ordinateur distant doit supporter DCOM (Distributed COM)

source: The remote computer must have 'Remote Registry Service' and 'File and Printer sharing' services running.
fr: L'ordinateur distant doit avoir les services 'Remote Registry Service' et 'File and Printer sharing' en cours d'exécution.

source: Counting the number of open shell windows
fr: Compte le nombre de fenêtres shell ouvertes

source: Get the Windows Shell Object
fr: Obtient l'objet Shell Windows

source: Get the collection of open shell Windows
fr: Obtient la collection de Windows shell ouvertes

source: String for displaying purposes
fr: Chaîne à des fins d'affichage

source: Count all existing shell windows
fr: Compte toutes les fenêtres shell existantes

source: Open the MediaPlayer on a REMOTE computer
fr: Ouvre MediaPlayer sur un ordinateur distant

source: Play sound if file is present
fr: Joue un son si le fichier est présent

source: A variable containing an Object from which you want to receive events
fr: Une variable contenant un objet à partir duquel vous souhaitez recevoir des événements

source: The prefix of the functions you define to handle receiving events.
fr: Le préfixe des fonctions que vous définissez pour gérer les événements reçus.

source: The prefix is appended by the Objects method name.
fr: Le préfixe est ajouté au nom des méthodes des objets.

source: name of an Event interface to use.
fr: nom d'une interface d'événement à utiliser.

source: It must be a supported as outgoing for the
fr: Il doit être pris en charge comme un sortant pour l'

source: Object AND it must be of type DISPATCH.
fr: Objet ET il doit être de type DISPATCH.

source: an object or a function name.
fr: Retourne un objet ou un nom de fonction.

source: The first format is used to receive Events from the given Object.
fr: Le premier format est utilisé pour recevoir des événements de l'objet donné.

source: To receive a specific event, create an AutoIt function name using the given prefix appended with the event name.
fr: Pour recevoir un événement particulier, créez un nom de fonction AutoIt en utilisant le préfixe donné en annexe avec le nom de l'événement.

source: The second format is used for COM Error Handling.
fr: Le second format est utilisé pour gérer les erreurs COM.

source: If any COM error occurs, the given function is being called.
fr: Si une erreur COM se produit, la fonction donnée est appelée.

source: First parameter for the function will be error object.
fr: Le premier paramètre de la fonction sera l'objet d'erreur.

source: You can use it to access different properties of this object.
fr: Vous pouvez l'utiliser pour accéder aux propriétés différentes de cet objet.

source: If the second parameter is omitted, it will return the name of the current Error handler function or function, depending what was used when registering.
fr: Si le second paramètre est omis, elle retournera le nom de la fonction du gestionnaire d'erreur en cours ou de la fonction, selon ce qui a été utilisé lors de l'enregistrement.

source: Properties of the AutoIt Error Object:
fr: Propriétés de l'objet Erreur AutoIt :

source: The Windows HRESULT value from a COM call
fr: La valeur HRESULT de Windows d'un appel COM

source: The FormatWinError() text derived from .number
fr: Le texte FormatWinError() dérivé de .number

source: Name of the Object generating the error (contents from ExcepInfo.source)
fr: Nom de l'objet généré par l'erreur (contenu de ExcepInfo.source )

source: Source Object's description of the error (contents from ExcepInfo.description)
fr: Description de l'objet source de l'erreur (contenu de ExcepInfo.description)

source: Source Object's helpfile for the error (contents from ExcepInfo.helpfile)
fr: Le fichier d'aide de l'objet source de l'erreur (contenu de ExcepInfo.helpfile)

source: Source Object's helpfile context id number (contents from ExcepInfo.helpcontext)
fr: L'ID du contexte du fichier d'aide de l'objet de la source (contenu de ExcepInfo.helpcontext)

source: The number returned from GetLastError()
fr: Le nombre renvoyé par GetLastError()

source: The script line on which the error was generated
fr: La ligne du script sur laquelle l'erreur est apparue

source: See the Obj/COM Reference for a detailed explanation.
fr: Consultez Référence Obj/COM pour une explication détaillée.

source: Error monitoring.
fr: Suivi d'erreur.

source: This will trap all COM errors while alive.
fr: Ce code piège toutes les erreurs COM pendant l'exécution.

source: This particular object is declared as local, meaning after the function returns it will not exist.
fr: Cet objet particulier est déclarée en local, ce qui signifie qu'après le retour de la fonction, il n'existera plus.

source: Create Internet Explorer object
fr: Crée un objet Internet Explorer

source: Check for errors
fr: Vérifie les erreurs

source: set visibility
fr: Définit la visibilité

source: Custom sink object
fr: Objet sink personnel

source: Navigate somewhere
fr: Navigue quelque part

source: Check for errors while loading
fr: Vérifie les erreurs lors du chargement

source: Wait for page to load
fr: Attend que la page se charge

source: Deliberately cause error by calling non-existing method
fr: Provoque délibérément une erreur en appelant une méthode qui n'existe pas

source: Wait few seconds to see if more events will be fired
fr: Attend quelques secondes pour voir si d'autres événements seront déclenchés

source: Nothing more to do.
fr: Rien de plus à faire.

source: Close IE and return from the function
fr: Ferme IE et retourne

source: BeforeNavigate2 method definition
fr: Définition de la méthode BeforeNavigate2

source: e.g. default property and name for the object
fr: par exemple la propriété et le nom par défaut de l'objet

source: User's COM error function.
fr: La fonction d'erreur COM de l'utilisateur.

source: Will be called if COM error occurs
fr: Sera appelée en cas d'erreur COM

source: Do anything here.
fr: Faire quelque chose ici.

source: The full path and name to the file containing the object (See remarks).
fr: Le chemin d'accès complet et le nom du fichier contenant l'objet (Voir Remarques ).

source: Class identifier.
fr: Identifiant de classe.

source: Can be in either ProgID or the string representation of the CLSID.
fr: Peut être ProgID ou la représentation chaîne du CLSID.

source: Instance of the object for ROT objects of the same (co)class.
fr: Instance de l'objet pour les objets ROT da la même classe.

source: The filename is optional if you want to use only the class identifier, but the parameter can't be omitted.
fr: Le nom du fichier est facultatif si vous souhaitez utiliser uniquement l'identifiant de classe, mais le paramètre ne peut pas être omis.

source: Use an empty string if you want to access objects from running objects table (ROT).
fr: Utilisez une chaîne vide si vous voulez accéder à des objets de la Table des Objets en cours d'Exécution (Running Object Table).

source: You can use third parameter to specify wanted instance in that case.
fr: Vous pouvez utiliser la troisième paramètre pour spécifier l'instance désirée dans ce cas.

source: In all other cases third parameter is ignored.
fr: Dans tous les autres cas, la troisième paramètre est ignoré.

source: If you use a filename, the classname is optional.
fr: Si vous utilisez un nom de fichier, le nom de classe est facultatif.

source: It's only required when you want to load an object of a specific class.
fr: Il est uniquement nécessaire si vous voulez charger un objet d'une classe spécifique.

source: Classname parameter does not have default value.
fr: Le paramètre Classname ne peut pas avoir une valeur par défaut.

source: If it's specified then it's processed.
fr: Si il est spécifié, alors il est traité.

source: Example getting an Object using it's class name
fr: Exemple qui obtient un objet en utilisant son nom de classe

source: ; Excel must be activated for this example to be successful
fr: ; Excel doit être activé pour cet exemple

source: Get an existing Excel Object
fr: Obtient un objet Excel existant

source: Let the guy show himself
fr: Affiche la gui

source: Add a new workbook
fr: Ajoute un nouveau classeur

source: Example getting an Object using a file name
fr: Exemple qui obtient un objet en utilisant un nom de fichier

source: ; An Excel file with filename Worksheet.xls must be created in the script directory
fr: ; Un fichier Excel avec le nom du fichier Worksheet.xls doit être créé dans le répertoire de script

source: in order for this example to work.
fr: pour que cet exemple fonctionne.

source: Get an Excel Object from an existing filename
fr: Obtient un objet Excel à partir d'un nom de fichier existant

source: Tip:
fr: Astuce:

source: Uncomment these lines to make Excel visible (credit:
fr: Supprimez ces lignes pour rendre Excel visible:(crédit :

source: $oExcelDoc.Windows(1).Visible = 1; Set the first worksheet in the workbook visible
fr: oExcelDoc.Windows $(1) = 1.Visible; Définit la première feuille de calcul dans le classeur visible

source: $oExcelDoc.Application.Visible = 1; Set the application visible (without this Excel will exit)
fr: oExcelDoc.Application.Visible $= 1; Définir l'application visible (sans que Excel quitte)

source: Close the Excel document
fr: Ferme le document Excel

source: A variable containing an Object whose name you want to retrieve
fr: Une variable contenant un objet dont vous souhaitez récupérer le nom

source: 1 = (default) The name of the Object
fr: = 1 (par défaut) Le nom de l'objet

source: 2 = Description string of the Object
fr: 2 = Chaîne de description de l'objet

source: 3 = The ProgID of the Object
fr: 3 = Le ProgID de l'objet

source: 4 = The file that is associated with the object in the Registry
fr: 4 = Le fichier qui est associée à l'objet dans le Registre

source: 5 = Module name in which the object runs (WIN XP And above).
fr: 5 = nom du module dans lequel l'objet s'exécute (WIN XP et supérieur).

source: 6 = CLSID of the object's coclass
fr: 6 = CLSID de la co-classe de l'objet

source: 7 = IID of the object's interface
fr: 7 = IID de l'interface de l'objet

source: a string representing the name
fr: Retourne une chaîne représentant le nom

source: Not all Objects support flags 2 to 7.
fr: Tous les objets ne supportent pas les flags 2 à 7.

source: Always test for @error in these cases.
fr: Toujours tester @error dans ces cas.

source: Opening a web page that contains a form
fr: Ouvre une page web qui contient un formulaire

source: Give the page time to load
fr: Donne à la page le temps de se charger

source: Example object to test
fr: Exemple d'objet à tester

source: Registers a function to be called when AutoIt exits.
fr: Enregistre une fonction qui est appelée quand AutoIt s'arrête.

source: @extended can be set if already registered.
fr: @extended peut être défini si déjà enregistré.

source: The exit code can be retrieved with @exitCode.
fr: Le code de sortie peut être récupéré avec @exitCode.

source: The mode of exit can be retrieved with @exitMethod.
fr: Le mode de sortie peut être récupéré avec @exitMethod.

source: Natural closing.
fr: Termine normalement.

source: close by Exit function.
fr: Termine par la fonction exit.

source: close by clicking on exit of the systray.
fr: Termine par un clic sur Fermer dans la zone de notification.

source: close by user logoff.
fr: Termine par déconnexion de l'utilisateur.

source: close by Windows shutdown.
fr: Termine par arrêt de Windows.

source: UnRegisters a function that was called when AutoIt exits.
fr: Annule l'inscription d'une fonction appelée lorsque AutoIt se termine.

source: The name of the user function that was called.
fr: Le nom de la fonction utilisateur.

source: Can be i.e."www.autoitscript.com" or "87.106.244.38".
fr: Peut être par exemple "www.autoitscript.com" ou "87.106.244.38".

source: Is the time to wait for an answer in milliseconds (default is 4000).
fr: Temps d'attente pour une réponse en millisecondes (4000 par défaut).

source: the roundtrip-time in milliseconds ( greater than 0 ).
fr: Retourne le temps de réponse en millisecondes (supérieur à 0).

source: 0 if host is not pingable or other network errors occurred and sets the @error flag to non-zero.
fr: Retourne 0 si l'hôte n'est pas joignable ou autres erreurs réseau et définit @error <> 0.(Voir remarques).

source: 1 = Host is offline
fr: 1 = Hôte déconnecté

source: 2 = Host is unreachable
fr: 2 = Hhôte est inaccessible

source: 3 = Bad destination
fr: 3 = Mauvaise destination

source: 4 = Other errors
fr: 4 = Autres erreurs

source: Ping the AutoIt website with a timeout of 250ms.
fr: Ping, le site AutoIt avec un délai d'attente de 250 ms.

source: If a value greater than 0 was returned then display the following message.
fr: Si une valeur supérieure à 0 est ensuite retournée, affiche le message suivant.

source: left coordinate of rectangle.
fr: Abscisse du coin NW du rectangle.

source: top coordinate of rectangle.
fr: Ordonnée du coin NW du rectangle.

source: right coordinate of rectangle.
fr: Abscisse du coin SE du rectangle.

source: bottom coordinate of rectangle.
fr: Ordonnée du coin SE du rectangle.

source: Instead of checksumming each pixel use a value larger than 1 to skip pixels (for speed).E.g.
fr: Au lieu de faire la somme de contrôle pour chaque pixel utilisez une valeur supérieure à 1 pour sauter des pixels (pour améliorer la vitesse).

source: A value of 2 will only check every other pixel.
fr: Par exemple une valeur de 2 fait la somme d'un pixel sur 2.

source: It is not recommended to use a step value greater than 1.
fr: Il n'est recommandé d'utiliser une valeur du pas plus grande que 1.

source: Window handle to be used.
fr: Handle de fenêtre à utiliser.

source: Default is the desktop window.
fr: Par défaut c'est la fenêtre du bureau.

source: default 0 ADLER checksum, 1 CRC32 Checksum.
fr: 0 = par défaut, somme de contrôle de ADLER, 1 = somme de contrôle CRC32.

source: the checksum value of the region.
fr: Retourne la valeur de la somme de contrôle de la région.

source: A checksum only allows you to see if "something" has changed in a region - it does not tell you exactly what has changed.
fr: Une somme de contrôle vous permet seulement de voir si "quelque chose" a changé dans une région - elle ne vous dit pas exactement ce qui a changé.

source: CRC32 checksum is a little slower than ADLDER but detects better pixel variation.
fr: Le contrôle CRC32 est un peu plus lent que ADLDER mais détecte mieux une variation de pixel.

source: Wait until something changes in the region 0,0 to 50,50
fr: Attend jusqu'à ce que quelque chose change dans la région 0,0 à 50,50

source: Get initial checksum
fr: Obtient une somme de contrôle initiale

source: Wait for the region to change, the region is checked every 100ms to reduce CPU load
fr: Attend que la région change, la région est contrôlée toutes les 100ms pour réduire la charge du CPU

source: x coordinate of pixel.
fr: Abscisse du pixel.

source: y coordinate of pixel.
fr: Ordonnée du pixel.

source: Window handle to be used.Default is the desktop window.
fr: Handle de la fenêtre à utiliser.

source: a decimal value of pixel's color.
fr: Retourne la valeur décimale de la couleur du pixel.

source: -1 if invalid coordinates.
fr: Retourne -1 si les coordonnées sont invalides.

source: Color value of pixel to find (in decimal or hex).
fr: Valeur de la couleur du pixel à trouver (en décimal ou hexadécimal).

source: A number between 0 and 255 to indicate the allowed number of shades of variation of the red, green, and blue components of the color.
fr: Un nombre entre 0 et 255 pour indiquer le nombre de variation de nuances autorisées des composantes rouge, verte et bleue de la couleur.

source: Default is 0 (exact match).
fr: Par défaut 0 (correspondance exacte).

source: Instead of searching each pixel use a value larger than 1 to skip pixels (for speed).
fr: Au lieu de chercher chaque pixel, utilisez une valeur supérieure à 1 pour passer certains pixels (pour augmenter la vitesse).

source: E.g.
fr: Par exemple :

source: a two-element array of pixel's coordinates.
fr: Retourne un tableau à deux éléments, des coordonnées du pixel.

source: sets the @error flag to 1 if the color is not found.
fr: Retourne @error = 1 si la couleur n'est pas trouvée.

source: The search direction varies as follows:
fr: La direction de la recherche varie selon ce qui suit :

source: Left-to-Right - left < right
fr: De gauche à droite si left < right

source: Right-to-Left - right < left
fr: De droite à gauche si right < left

source: Top-to-Bottom - top < bottom
fr: De haut en bas si top < bottom

source: Bottom-to-Top - bottom < top
fr: De bas en haut si bottom < top

source: Changing the search direction can be a useful optimization if the color being searched for frequently appears in in a specific quadrat of the search area since less searching is done if the search starts in the most common quadrant.
fr: Changer la direction de recherche peut être une optimisation utile si la couleur recherchée apparaît fréquemment dans une zone spécifique de la zone de recherche.La recherche sera réduite, si elle débute dans la zone la plus courante.

source: Remember, a typical display at 1024 x 768 has 786432 pixels.
fr: N'oubliez pas qu'un affichage en 1024 x 768 contient 786 432 pixels.

source: Although PixelSearch() is optimized, narrowing the search area helps speed up the result.
fr: Bien que PixelSearch() soit optimisé, la réduction de la zone de recherche permet d'accélérer le résultat.

source: Find a pure red pixel in the range 0,0-20,300
fr: Trouve un pixel rouge pur dans la zonz (0,0)-(20,300)

source: Find a pure red pixel or a red pixel within 10 shades variations of pure red
fr: Trouve un pixel rouge pur ou un pixel rouge dans 10 variations de coloris de rouge pur

source: Process user defined functions Reference
fr: Process - Référence

source: When using them you need to add a #include <WinAPIProc.au3>.
fr: Pour les utiliser, vous aurez besoin d'ajouter #include <WinAPIProc.au3>.

source: Terminates a named process.
fr: Termine un processus identifié.

source: The name or PID of the process to terminate.
fr: Le nom ou le PID du processus à terminer.

source: 1 = OpenProcess failed
fr: 1 = L'ouverture du processus à échoué.

source: 2 = AdjustTokenPrivileges Failed
fr: 2 = Vous n'avez pas les privilèges requis.

source: 3 = TerminateProcess Failed
fr: 3 = La fermeture du processus à échoué.

source: 4 = Cannot verify if process exists
fr: 4 = Ne peut vérifier l’existence du processus

source: sets to Windows API GetLastError()
fr: Contient Windows API GetLastError()

source: Process names are executables without the full path, e.g.,"notepad.exe" or "winword.exe"
fr: Les noms des processus sont fonctionnels sans le chemin complet, par exemple, "notepad.exe" ou "winword.exe"

source: If multiple processes have the same name, the one with the highest PID is terminated--regardless of how recently the process was spawned.
fr: Si plusieurs processus ont le même nom, celui avec le plus grand PID est terminé, selon le processus le plus récemment engendré.
